app/controllers/users_controller.rb

  def show
    #books一覧では自分の画像が表示される。current_userカラムの"レコード"を渡すので、右辺はcurrent_userと表記。
    @user = User.find(params[:id]) # renderでshowページにsidebar.html.erbを呼び出すときにも利用可能。CreateBook
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]